// data/movies.js
export const movies = [
	{
		id: 1,
		title: "Пригоди Паддінгтона в Перу",
		genre: "Пригоди, Комедія, Сімейний",
		description:
			"Родина Браунів вирушає до Перу, щоб відвідати рідний край Паддінгтона та його тітку Люсі. ",
		posterUrl: "../src/img/1.webp",
		schedule: [
			{ date: "2025-04-12", time: "14:30" },
			{ date: "2025-04-12", time: "18:00" },
			{ date: "2025-04-13", time: "15:45" },
		],
	},
	{
		id: 2,
		title: "Сентиментальна подорож до планети Параджанова",
		genre: "Документальний",
		description:
			"Фільм розкриває період роботи Параджанова над «Тінями забутих предків.",
		posterUrl: "../src/img/2.webp",
		schedule: [
			{ date: "2025-04-12", time: "16:15" },
			{ date: "2025-04-12", time: "20:30" },
			{ date: "2025-04-13", time: "17:00" },
		],
	},
	{
		id: 3,
		title: "Спляча красуня",
		genre: "Пригоди, Фентезі, Сімейний",
		description:
			"Фільм «Спляча красуня» — вільна німецька адаптація казки про принца, який рятує зачаровану принцесу.",
		posterUrl: "../src/img/3.webp",
		schedule: [
			{ date: "2025-04-12", time: "13:45" },
			{ date: "2025-04-12", time: "19:15" },
			{ date: "2025-04-13", time: "14:30" },
		],
	},
	{
		id: 4,
		title: "Бетмен",
		genre: "Бойовик",
		description:
			"«Бетмен» став першим культурним феноменом, що змінив ставлення Голлівуду до коміксів.",
		posterUrl: "../src/img/4.webp",
		schedule: [
			{ date: "2025-04-12", time: "15:30" },
			{ date: "2025-04-12", time: "21:00" },
			{ date: "2025-04-13", time: "16:45" },
		],
	},
	{
		id: 5,
		title: "Місія неможлива: Фінальна розплата",
		genre: "Бойовик",
		description:
			"Найкращий агент таємної служби отримує чергове завдання, найскладніше за всю його кар’єру.",
		posterUrl: "../src/img/5.webp",
		schedule: [
			{ date: "2025-04-12", time: "14:00" },
			{ date: "2025-04-12", time: "18:45" },
			{ date: "2025-04-13", time: "15:15" },
		],
	},
	{
		id: 6,
		title: "Мавка",
		genre: "Пригоди, Анімація, Сімейний",
		description:
			"Наша історія - про магічну силу кохання, яке об' шкода, рятує та дарує життя .",
		posterUrl: "../src/img/6.jpeg",
		schedule: [
			{ date: "2025-04-12", time: "16:00" },
			{ date: "2025-04-12", time: "20:15" },
			{ date: "2025-04-13", time: "17:30" },
		],
	},
];
